apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c_pinmap.h
/************************************************************************************
 * arch/arm/src/tiva/hardware/tm4c/tm4c_pinmap.h
 *
 *   Copyright (C) 2014 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_SRC_TIVA_HARDWARE_TM4C_TM4C_PINMAP_H
#define __ARCH_ARM_SRC_TIVA_HARDWARE_TM4C_TM4C_PINMAP_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/
/* Alternate Pin Functions.  All members of the TM4C family share the same pin
 * multiplexing (although they may differ in the pins physically available).
 *
 * Alternative pin selections are provided with a numeric suffix like _1, _2, etc.
 * Drivers, however, will use the pin selection without the numeric suffix.
 * Additional definitions are required in the board.h file.  For example, if
 * CAN1_RX connects via PN0 on some board, then the following definitions should
 * appear in the board.h header file for that board:
 *
 * #define GPIO_CAN1_RX GPIO_CAN1_RX_1
 *
 * The driver will then automatically configure PA11 as the CAN1 RX pin.
 */

/* WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!!
 * Additional effort is required to select specific GPIO options such as frequency,
 * open-drain/push-pull, and pull-up/down!  Just the basics are defined for most
 * pins in this file.
 */

#if defined(CONFIG_ARCH_CHIP_TM4C123GH6ZRB)

#  define GPIO_ADC_AIN0        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_3)
#  define GPIO_ADC_AIN1        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_2)
#  define GPIO_ADC_AIN2        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_1)
#  define GPIO_ADC_AIN3        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_0)
#  define GPIO_ADC_AIN4        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_ADC_AIN5        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_ADC_AIN6        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_5)
#  define GPIO_ADC_AIN7        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_4)
#  define GPIO_ADC_AIN8        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_5)
#  define GPIO_ADC_AIN9        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_ADC_AIN10       (GPIO_FUNC_ANINPUT                | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_ADC_AIN11       (GPIO_FUNC_ANINPUT                | GPIO_PORTB | GPIO_PIN_5)
#  define GPIO_ADC_AIN12       (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_ADC_AIN13       (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_ADC_AIN14       (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_ADC_AIN15       (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_ADC_AIN16       (GPIO_FUNC_ANINPUT                | GPIO_PORTK | GPIO_PIN_0)
#  define GPIO_ADC_AIN17       (GPIO_FUNC_ANINPUT                | GPIO_PORTK | GPIO_PIN_1)
#  define GPIO_ADC_AIN18       (GPIO_FUNC_ANINPUT                | GPIO_PORTK | GPIO_PIN_2)
#  define GPIO_ADC_AIN19       (GPIO_FUNC_ANINPUT                | GPIO_PORTK | GPIO_PIN_3)
#  define GPIO_ADC_AIN20       (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_7)
#  define GPIO_ADC_AIN21       (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_6)
#  define GPIO_ADC_AIN22       (GPIO_FUNC_ANINPUT                | GPIO_PORTN | GPIO_PIN_1)
#  define GPIO_ADC_AIN23       (GPIO_FUNC_ANINPUT                | GPIO_PORTN | GPIO_PIN_0)

#  define GPIO_CAN0_RX_1       (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_0)
#  define GPIO_CAN0_RX_2       (GPIO_FUNC_PFINPUT  | GPIO_ALT_3  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_CAN0_RX_3       (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_CAN0_RX_4       (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_CAN0_TX_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_1)
#  define GPIO_CAN0_TX_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_CAN0_TX_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTB | GPIO_PIN_5)
#  define GPIO_CAN0_TX_4       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTE | GPIO_PIN_5)
#  define GPIO_CAN1_RX_1       (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTA | GPIO_PIN_0)
#  define GPIO_CAN1_RX_2       (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTE | GPIO_PIN_6)
#  define GPIO_CAN1_TX_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTA | GPIO_PIN_1)
#  define GPIO_CAN1_TX_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTE | GPIO_PIN_7)

#  define GPIO_CMP0_NIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTC | GPIO_PIN_7)
#  define GPIO_CMP0_OUT_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTK | GPIO_PIN_4)
#  define GPIO_CMP0_OUT_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_9  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_CMP0_PIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTC | GPIO_PIN_6)
#  define GPIO_CMP1_NIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_CMP1_OUT_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTK | GPIO_PIN_5)
#  define GPIO_CMP1_OUT_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_9  | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_CMP1_PIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_CMP2_NIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTJ | GPIO_PIN_5)
#  define GPIO_CMP2_OUT_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTK | GPIO_PIN_6)
#  define GPIO_CMP2_OUT_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_9  | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_CMP2_PIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTJ | GPIO_PIN_4)

#  define GPIO_HIB_RTCCLK      (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTK | GPIO_PIN_4)

#  define GPIO_I2C0_SCL        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_2)
#  define GPIO_I2C0_SDA        (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_3 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C1_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_I2C1_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTG | GPIO_PIN_4)
#  define GPIO_I2C1_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_7 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C1_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTG | GPIO_PIN_5 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C2_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_I2C2_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTF | GPIO_PIN_6)
#  define GPIO_I2C2_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTE | GPIO_PIN_5 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C2_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTF | GPIO_PIN_7 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C3_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_I2C3_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTG | GPIO_PIN_0)
#  define GPIO_I2C3_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_1 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C3_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTG | GPIO_PIN_1 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C4_SCL        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTG | GPIO_PIN_2)
#  define GPIO_I2C4_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTG | GPIO_PIN_3 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C4_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTG | GPIO_PIN_3 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C5_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_6)
#  define GPIO_I2C5_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTG | GPIO_PIN_6)
#  define GPIO_I2C5_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_7 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C5_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTG | GPIO_PIN_7 | GPIO_PADTYPE_ODWPU)

#  define GPIO_M0_PWM0_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_0)
#  define GPIO_M0_PWM0_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTB | GPIO_PIN_6)
#  define GPIO_M0_PWM0_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTH | GPIO_PIN_0)
#  define GPIO_M0_PWM1_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_1)
#  define GPIO_M0_PWM1_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTB | GPIO_PIN_7)
#  define GPIO_M0_PWM1_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTH | GPIO_PIN_1)
#  define GPIO_M0_PWM2_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_2)
#  define GPIO_M0_PWM2_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_M0_PWM2_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTH | GPIO_PIN_2)
#  define GPIO_M0_PWM3_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_3)
#  define GPIO_M0_PWM3_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTB | GPIO_PIN_5)
#  define GPIO_M0_PWM3_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTH | GPIO_PIN_3)
#  define GPIO_M0_PWM4_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_4)
#  define GPIO_M0_PWM4_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTM | GPIO_PIN_6)
#  define GPIO_M0_PWM4_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_M0_PWM4_4       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTG | GPIO_PIN_4)
#  define GPIO_M0_PWM4_5       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTH | GPIO_PIN_4)
#  define GPIO_M0_PWM5_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_5)
#  define GPIO_M0_PWM5_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTM | GPIO_PIN_7)
#  define GPIO_M0_PWM5_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTE | GPIO_PIN_5)
#  define GPIO_M0_PWM5_4       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTG | GPIO_PIN_5)
#  define GPIO_M0_PWM5_5       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTH | GPIO_PIN_5)
#  define GPIO_M0_PWM6_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_6)
#  define GPIO_M0_PWM6_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_2)
#  define GPIO_M0_PWM6_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_M0_PWM6_4       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_M0_PWM6_5       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTG | GPIO_PIN_6)
#  define GPIO_M0_PWM6_6       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTH | GPIO_PIN_6)
#  define GPIO_M0_PWM7_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_7)
#  define GPIO_M0_PWM7_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_3)
#  define GPIO_M0_PWM7_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_M0_PWM7_4       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_M0_PWM7_5       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTG | GPIO_PIN_7)
#  define GPIO_M0_PWM7_6       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTH | GPIO_PIN_7)
#  define GPIO_M0_PWM_FAULT0_1 (GPIO_FUNC_PFINPUT  | GPIO_ALT_4  | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_M0_PWM_FAULT0_2 (GPIO_FUNC_PFINPUT  | GPIO_ALT_4  | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_M0_PWM_FAULT0_3 (GPIO_FUNC_PFINPUT  | GPIO_ALT_4  | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_M0_PWM_FAULT0_4 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTH | GPIO_PIN_0)
#  define GPIO_M0_PWM_FAULT0_5 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_4)
#  define GPIO_M0_PWM_FAULT1_1 (GPIO_FUNC_PFINPUT  | GPIO_ALT_4  | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_M0_PWM_FAULT1_2 (GPIO_FUNC_PFINPUT  | GPIO_ALT_4  | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_M0_PWM_FAULT1_3 (GPIO_FUNC_PFINPUT  | GPIO_ALT_4  | GPIO_PORTG | GPIO_PIN_2)
#  define GPIO_M0_PWM_FAULT1_4 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTH | GPIO_PIN_1)
#  define GPIO_M0_PWM_FAULT1_5 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_5)
#  define GPIO_M0_PWM_FAULT2_1 (GPIO_FUNC_PFINPUT  | GPIO_ALT_4  | GPIO_PORTF | GPIO_PIN_4)
#  define GPIO_M0_PWM_FAULT2_2 (GPIO_FUNC_PFINPUT  | GPIO_ALT_4  | GPIO_PORTG | GPIO_PIN_3)
#  define GPIO_M0_PWM_FAULT2_3 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTH | GPIO_PIN_2)
#  define GPIO_M0_PWM_FAULT2_4 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_6)
#  define GPIO_M0_PWM_FAULT3_1 (GPIO_FUNC_PFINPUT  | GPIO_ALT_4  | GPIO_PORTF | GPIO_PIN_5)
#  define GPIO_M0_PWM_FAULT3_2 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTH | GPIO_PIN_3)
#  define GPIO_M0_PWM_FAULT3_3 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_7)
#  define GPIO_M1_PWM0_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTQ | GPIO_PIN_0)
#  define GPIO_M1_PWM0_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_M1_PWM0_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTG | GPIO_PIN_2)
#  define GPIO_M1_PWM1_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTQ | GPIO_PIN_1)
#  define GPIO_M1_PWM1_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_M1_PWM1_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTG | GPIO_PIN_3)
#  define GPIO_M1_PWM2_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTQ | GPIO_PIN_2)
#  define GPIO_M1_PWM2_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_M1_PWM2_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_M1_PWM2_4       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTG | GPIO_PIN_4)
#  define GPIO_M1_PWM3_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTQ | GPIO_PIN_3)
#  define GPIO_M1_PWM3_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTA | GPIO_PIN_7)
#  define GPIO_M1_PWM3_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTE | GPIO_PIN_5)
#  define GPIO_M1_PWM3_4       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTG | GPIO_PIN_5)
#  define GPIO_M1_PWM4_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTQ | GPIO_PIN_4)
#  define GPIO_M1_PWM4_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_4)
#  define GPIO_M1_PWM4_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_M1_PWM5_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTQ | GPIO_PIN_5)
#  define GPIO_M1_PWM5_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_5)
#  define GPIO_M1_PWM5_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_M1_PWM6_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTQ | GPIO_PIN_6)
#  define GPIO_M1_PWM6_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_6)
#  define GPIO_M1_PWM6_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_M1_PWM7_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTQ | GPIO_PIN_7)
#  define GPIO_M1_PWM7_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_7)
#  define GPIO_M1_PWM7_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_M1_PWM_FAULT0_1 (GPIO_FUNC_PFINPUT  | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_4)
#  define GPIO_M1_PWM_FAULT0_2 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_0)
#  define GPIO_M1_PWM_FAULT0_3 (GPIO_FUNC_PFINPUT  | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_7)
#  define GPIO_M1_PWM_FAULT1_1 (GPIO_FUNC_PFINPUT  | GPIO_ALT_5  | GPIO_PORTG | GPIO_PIN_0)
#  define GPIO_M1_PWM_FAULT1_2 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_1)
#  define GPIO_M1_PWM_FAULT2_1 (GPIO_FUNC_PFINPUT  | GPIO_ALT_5  | GPIO_PORTG | GPIO_PIN_1)
#  define GPIO_M1_PWM_FAULT2_2 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_2)
#  define GPIO_M1_PWM_FAULT3   (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_3)

#  define GPIO_NMI_1           (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_NMI_2           (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTF | GPIO_PIN_0)

