apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c_pinmap.h
#  define GPIO_QEI0_IDX_1      (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTH | GPIO_PIN_1)
#  define GPIO_QEI0_IDX_2      (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTJ | GPIO_PIN_2)
#  define GPIO_QEI0_IDX_3      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_QEI0_IDX_4      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_4)
#  define GPIO_QEI0_PHA_1      (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTH | GPIO_PIN_4)
#  define GPIO_QEI0_PHA_2      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_QEI0_PHA_3      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_QEI0_PHB_1      (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTH | GPIO_PIN_5)
#  define GPIO_QEI0_PHB_2      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_QEI0_PHB_3      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_QEI1_IDX_1      (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTG | GPIO_PIN_7)
#  define GPIO_QEI1_IDX_2      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_QEI1_IDX_3      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTG | GPIO_PIN_5)
#  define GPIO_QEI1_PHA_1      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_QEI1_PHA_2      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTG | GPIO_PIN_0)
#  define GPIO_QEI1_PHA_3      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTG | GPIO_PIN_3)
#  define GPIO_QEI1_PHB_1      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTC | GPIO_PIN_6)
#  define GPIO_QEI1_PHB_2      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTG | GPIO_PIN_1)
#  define GPIO_QEI1_PHB_3      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTG | GPIO_PIN_4)

#  define GPIO_SSI0_CLK        (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_2)
#  define GPIO_SSI0_FSS        (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_3)
#  define GPIO_SSI0_RX         (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_4)
#  define GPIO_SSI0_TX         (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_5)
#  define GPIO_SSI1_CLK_1      (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_SSI1_CLK_2      (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_SSI1_FSS_1      (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_SSI1_FSS_2      (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_SSI1_RX_1       (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_SSI1_RX_2       (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_SSI1_TX_1       (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_SSI1_TX_2       (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_SSI2_CLK_1      (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_SSI2_CLK_2      (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTH | GPIO_PIN_4)
#  define GPIO_SSI2_FSS_1      (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_5)
#  define GPIO_SSI2_FSS_2      (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTH | GPIO_PIN_5)
#  define GPIO_SSI2_RX_1       (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_6)
#  define GPIO_SSI2_RX_2       (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTH | GPIO_PIN_6)
#  define GPIO_SSI2_TX_1       (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_7)
#  define GPIO_SSI2_TX_2       (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTH | GPIO_PIN_7)
#  define GPIO_SSI3_CLK_1      (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_SSI3_CLK_2      (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTH | GPIO_PIN_0)
#  define GPIO_SSI3_CLK_3      (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTK | GPIO_PIN_0)
#  define GPIO_SSI3_FSS_1      (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_SSI3_FSS_2      (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTH | GPIO_PIN_1)
#  define GPIO_SSI3_FSS_3      (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTK | GPIO_PIN_1)
#  define GPIO_SSI3_RX_1       (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_SSI3_RX_2       (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTH | GPIO_PIN_2)
#  define GPIO_SSI3_RX_3       (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTK | GPIO_PIN_2)
#  define GPIO_SSI3_TX_1       (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_SSI3_TX_2       (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTH | GPIO_PIN_3)
#  define GPIO_SSI3_TX_3       (GPIO_FUNC_PFIO     | GPIO_ALT_2  | GPIO_PORTK | GPIO_PIN_3)

#  define GPIO_TCK_SWCLK       (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_0)
#  define GPIO_TDI             (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_2)
#  define GPIO_TDO_SWO         (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_3)
#  define GPIO_TMS_SWDIO       (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_1)

#  define GPIO_TR_CLK          (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_TR_D0           (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_TR_D1           (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_TR_D2           (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_TR_D3           (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_4)

#  define GPIO_TIM0_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTB | GPIO_PIN_6)
#  define GPIO_TIM0_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_TIM0_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTL | GPIO_PIN_0)
#  define GPIO_TIM0_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTB | GPIO_PIN_7)
#  define GPIO_TIM0_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_TIM0_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTL | GPIO_PIN_1)
#  define GPIO_TIM1_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_TIM1_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_TIM1_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTJ | GPIO_PIN_0)
#  define GPIO_TIM1_CCP0_4     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTL | GPIO_PIN_2)
#  define GPIO_TIM1_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTB | GPIO_PIN_5)
#  define GPIO_TIM1_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_TIM1_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTJ | GPIO_PIN_1)
#  define GPIO_TIM1_CCP1_4     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTL | GPIO_PIN_3)
#  define GPIO_TIM2_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTB | GPIO_PIN_0)
#  define GPIO_TIM2_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTF | GPIO_PIN_4)
#  define GPIO_TIM2_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTJ | GPIO_PIN_2)
#  define GPIO_TIM2_CCP0_4     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTL | GPIO_PIN_4)
#  define GPIO_TIM2_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTB | GPIO_PIN_1)
#  define GPIO_TIM2_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTF | GPIO_PIN_5)
#  define GPIO_TIM2_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTJ | GPIO_PIN_3)
#  define GPIO_TIM2_CCP1_4     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTL | GPIO_PIN_5)
#  define GPIO_TIM3_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTB | GPIO_PIN_2)
#  define GPIO_TIM3_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTF | GPIO_PIN_6)
#  define GPIO_TIM3_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTJ | GPIO_PIN_4)
#  define GPIO_TIM3_CCP0_4     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTL | GPIO_PIN_6)
#  define GPIO_TIM3_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTB | GPIO_PIN_3)
#  define GPIO_TIM3_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTF | GPIO_PIN_7)
#  define GPIO_TIM3_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTJ | GPIO_PIN_5)
#  define GPIO_TIM3_CCP1_4     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTL | GPIO_PIN_7)
#  define GPIO_TIM4_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_0)
#  define GPIO_TIM4_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTG | GPIO_PIN_0)
#  define GPIO_TIM4_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTM | GPIO_PIN_0)
#  define GPIO_TIM4_CCP0_4     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTP | GPIO_PIN_0)
#  define GPIO_TIM4_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_1)
#  define GPIO_TIM4_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTG | GPIO_PIN_1)
#  define GPIO_TIM4_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTM | GPIO_PIN_1)
#  define GPIO_TIM4_CCP1_4     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTP | GPIO_PIN_1)
#  define GPIO_TIM5_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_2)
#  define GPIO_TIM5_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTG | GPIO_PIN_2)
#  define GPIO_TIM5_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTM | GPIO_PIN_2)
#  define GPIO_TIM5_CCP0_4     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTP | GPIO_PIN_2)
#  define GPIO_TIM5_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_3)
#  define GPIO_TIM5_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTG | GPIO_PIN_3)
#  define GPIO_TIM5_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTM | GPIO_PIN_3)
#  define GPIO_TIM5_CCP1_4     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTP | GPIO_PIN_3)

