apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c_pinmap.h
#  define GPIO_UART0_RX        (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_0)
#  define GPIO_UART0_TX        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_1)
#  define GPIO_UART1_CTS_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_UART1_CTS_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_UART1_DCD       (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_UART1_DSR       (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_UART1_DTR       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTF | GPIO_PIN_4)
#  define GPIO_UART1_RI        (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_7)
#  define GPIO_UART1_RTS_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_UART1_RTS_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_UART1_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTB | GPIO_PIN_0)
#  define GPIO_UART1_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_2  | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_UART1_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTB | GPIO_PIN_1)
#  define GPIO_UART1_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_UART2_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_UART2_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTG | GPIO_PIN_4)
#  define GPIO_UART2_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_UART2_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTG | GPIO_PIN_5)
#  define GPIO_UART3_RX        (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_6)
#  define GPIO_UART3_TX        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_7)
#  define GPIO_UART4_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_UART4_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_0)
#  define GPIO_UART4_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_UART4_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_1)
#  define GPIO_UART5_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_UART5_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_2)
#  define GPIO_UART5_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_5)
#  define GPIO_UART5_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_3)
#  define GPIO_UART6_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_4)
#  define GPIO_UART6_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_4)
#  define GPIO_UART6_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_5)
#  define GPIO_UART6_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_5)
#  define GPIO_UART7_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_0)
#  define GPIO_UART7_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTK | GPIO_PIN_4)
#  define GPIO_UART7_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_1)
#  define GPIO_UART7_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTK | GPIO_PIN_5)

#  define GPIO_USB0_DM         (GPIO_FUNC_ANIO                   | GPIO_PORTL | GPIO_PIN_7)
#  define GPIO_USB0_DP         (GPIO_FUNC_ANIO                   | GPIO_PORTL | GPIO_PIN_6)
#  define GPIO_USB0_EPEN_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTC | GPIO_PIN_6)
#  define GPIO_USB0_EPEN_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_USB0_EPEN_3     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTF | GPIO_PIN_4)
#  define GPIO_USB0_EPEN_4     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTG | GPIO_PIN_4)
#  define GPIO_USB0_ID         (GPIO_FUNC_ANINPUT                | GPIO_PORTB | GPIO_PIN_0)
#  define GPIO_USB0_PFLT_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTC | GPIO_PIN_7)
#  define GPIO_USB0_PFLT_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_USB0_PFLT_3     (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTF | GPIO_PIN_5)
#  define GPIO_USB0_PFLT_4     (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTG | GPIO_PIN_5)
#  define GPIO_USB0_VBUS       (GPIO_FUNC_ANIO                   | GPIO_PORTB | GPIO_PIN_1)

#  define GPIO_WTIM0_CCP0_1    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_WTIM0_CCP0_2    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTG | GPIO_PIN_4)
#  define GPIO_WTIM0_CCP0_3    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTM | GPIO_PIN_6)
#  define GPIO_WTIM0_CCP0_4    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTP | GPIO_PIN_4)
#  define GPIO_WTIM0_CCP0_5    (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTL | GPIO_PIN_0)
#  define GPIO_WTIM0_CCP1_1    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_WTIM0_CCP1_2    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTG | GPIO_PIN_5)
#  define GPIO_WTIM0_CCP1_3    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTM | GPIO_PIN_7)
#  define GPIO_WTIM0_CCP1_4    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTP | GPIO_PIN_5)
#  define GPIO_WTIM0_CCP1_5    (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTL | GPIO_PIN_1)
#  define GPIO_WTIM1_CCP0_1    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_6)
#  define GPIO_WTIM1_CCP0_2    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTG | GPIO_PIN_6)
#  define GPIO_WTIM1_CCP0_3    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTK | GPIO_PIN_6)
#  define GPIO_WTIM1_CCP0_4    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTP | GPIO_PIN_6)
#  define GPIO_WTIM1_CCP0_5    (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTL | GPIO_PIN_2)
#  define GPIO_WTIM1_CCP1_1    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_7)
#  define GPIO_WTIM1_CCP1_2    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTG | GPIO_PIN_7)
#  define GPIO_WTIM1_CCP1_3    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTK | GPIO_PIN_7)
#  define GPIO_WTIM1_CCP1_4    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTP | GPIO_PIN_7)
#  define GPIO_WTIM1_CCP1_5    (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTL | GPIO_PIN_3)
#  define GPIO_WTIM2_CCP0_1    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_WTIM2_CCP0_2    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTH | GPIO_PIN_0)
#  define GPIO_WTIM2_CCP0_3    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTN | GPIO_PIN_2)
#  define GPIO_WTIM2_CCP0_4    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTQ | GPIO_PIN_0)
#  define GPIO_WTIM2_CCP0_5    (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTL | GPIO_PIN_4)
#  define GPIO_WTIM2_CCP1_1    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_WTIM2_CCP1_2    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTH | GPIO_PIN_1)
#  define GPIO_WTIM2_CCP1_3    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTN | GPIO_PIN_3)
#  define GPIO_WTIM2_CCP1_4    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTQ | GPIO_PIN_1)
#  define GPIO_WTIM2_CCP1_5    (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTL | GPIO_PIN_5)
#  define GPIO_WTIM3_CCP0_1    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_WTIM3_CCP0_2    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTH | GPIO_PIN_4)
#  define GPIO_WTIM3_CCP0_3    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTN | GPIO_PIN_4)
#  define GPIO_WTIM3_CCP0_4    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTQ | GPIO_PIN_2)
#  define GPIO_WTIM3_CCP0_5    (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTL | GPIO_PIN_6)
#  define GPIO_WTIM3_CCP1_1    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_WTIM3_CCP1_2    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTH | GPIO_PIN_5)
#  define GPIO_WTIM3_CCP1_3    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTN | GPIO_PIN_5)
#  define GPIO_WTIM3_CCP1_4    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTQ | GPIO_PIN_3)
#  define GPIO_WTIM3_CCP1_5    (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTL | GPIO_PIN_7)
#  define GPIO_WTIM4_CCP0_1    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_4)
#  define GPIO_WTIM4_CCP0_2    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTH | GPIO_PIN_6)
#  define GPIO_WTIM4_CCP0_3    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTN | GPIO_PIN_6)
#  define GPIO_WTIM4_CCP0_4    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTQ | GPIO_PIN_4)
#  define GPIO_WTIM4_CCP0_5    (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTM | GPIO_PIN_0)
#  define GPIO_WTIM4_CCP1_1    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_5)
#  define GPIO_WTIM4_CCP1_2    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTH | GPIO_PIN_7)
#  define GPIO_WTIM4_CCP1_3    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTN | GPIO_PIN_7)
#  define GPIO_WTIM4_CCP1_4    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTQ | GPIO_PIN_5)
#  define GPIO_WTIM4_CCP1_5    (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTM | GPIO_PIN_1)
#  define GPIO_WTIM5_CCP0_1    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_WTIM5_CCP0_2    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTH | GPIO_PIN_2)
#  define GPIO_WTIM5_CCP0_3    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTQ | GPIO_PIN_6)
#  define GPIO_WTIM5_CCP0_4    (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTM | GPIO_PIN_2)
#  define GPIO_WTIM5_CCP1_1    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_WTIM5_CCP1_2    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTH | GPIO_PIN_3)
#  define GPIO_WTIM5_CCP1_3    (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTQ | GPIO_PIN_7)
#  define GPIO_WTIM5_CCP1_4    (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTM | GPIO_PIN_3)

#elif defined(CONFIG_ARCH_CHIP_TM4C123GH6PM)

#  define GPIO_ADC_AIN0        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_3)
#  define GPIO_ADC_AIN1        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_2)
#  define GPIO_ADC_AIN2        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_1)
#  define GPIO_ADC_AIN3        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_0)
#  define GPIO_ADC_AIN4        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_ADC_AIN5        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_ADC_AIN6        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_ADC_AIN7        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_ADC_AIN8        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_5)
#  define GPIO_ADC_AIN9        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_ADC_AIN10       (GPIO_FUNC_ANINPUT                | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_ADC_AIN11       (GPIO_FUNC_ANINPUT                | GPIO_PORTB | GPIO_PIN_5)

#  define GPIO_CAN0_RX_1       (GPIO_FUNC_PFINPUT  | GPIO_ALT_3  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_CAN0_RX_2       (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_CAN0_RX_3       (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_CAN0_TX_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_CAN0_TX_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTB | GPIO_PIN_5)
#  define GPIO_CAN0_TX_3       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTE | GPIO_PIN_5)
#  define GPIO_CAN1_RX_1       (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTA | GPIO_PIN_0)
#  define GPIO_CAN1_TX_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTA | GPIO_PIN_1)

#  define GPIO_CMP0_NIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTC | GPIO_PIN_7)
#  define GPIO_CMP0_OUT_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_9  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_CMP0_PIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTC | GPIO_PIN_6)
#  define GPIO_CMP1_NIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_CMP1_OUT_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_9  | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_CMP1_PIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTC | GPIO_PIN_5)

#  define GPIO_I2C0_SCL        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_2)
#  define GPIO_I2C0_SDA        (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_3 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C1_SCL        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_I2C1_SDA        (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_7 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C2_SCL        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_I2C2_SDA        (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTE | GPIO_PIN_5 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C3_SCL        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_I2C3_SDA        (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_1 | GPIO_PADTYPE_ODWPU)

#  define GPIO_M0_PWM0         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTB | GPIO_PIN_6)
#  define GPIO_M0_PWM1         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTB | GPIO_PIN_7)
#  define GPIO_M0_PWM2         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_M0_PWM3         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTB | GPIO_PIN_5)
#  define GPIO_M0_PWM4         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_M0_PWM5         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTE | GPIO_PIN_5)
#  define GPIO_M0_PWM6         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_M0_PWM7         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_4  | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_M0_PWM_FAULT0_1 (GPIO_FUNC_PFINPUT  | GPIO_ALT_4  | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_M0_PWM_FAULT0_2 (GPIO_FUNC_PFINPUT  | GPIO_ALT_4  | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_M0_PWM_FAULT0_3 (GPIO_FUNC_PFINPUT  | GPIO_ALT_4  | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_M1_PWM0         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_M1_PWM1         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_M1_PWM2_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_M1_PWM2_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_M1_PWM3_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTA | GPIO_PIN_7)
#  define GPIO_M1_PWM3_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTE | GPIO_PIN_5)
#  define GPIO_M1_PWM4         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_M1_PWM5         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_M1_PWM6         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_M1_PWM7         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_M1_PWM_FAULT0_1 (GPIO_FUNC_PFINPUT  | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_4)

#  define GPIO_NMI_1           (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_NMI_2           (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTF | GPIO_PIN_0)

#  define GPIO_QEI0_IDX_1      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_QEI0_IDX_2      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_4)
#  define GPIO_QEI0_PHA_1      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_QEI0_PHA_2      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_QEI0_PHB_1      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_QEI0_PHB_2      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_QEI1_IDX        (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_QEI1_PHA        (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_QEI1_PHB        (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTC | GPIO_PIN_6)

