apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c_pinmap.h
#  define GPIO_USB0_EPEN_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTC | GPIO_PIN_6)
#  define GPIO_USB0_EPEN_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_USB0_EPEN_3     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_8  | GPIO_PORTF | GPIO_PIN_4)
#  define GPIO_USB0_ID         (GPIO_FUNC_ANINPUT                | GPIO_PORTB | GPIO_PIN_0)
#  define GPIO_USB0_PFLT_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTC | GPIO_PIN_7)
#  define GPIO_USB0_PFLT_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_USB0_VBUS       (GPIO_FUNC_ANIO                   | GPIO_PORTB | GPIO_PIN_1)

#  define GPIO_WTIM0_CCP0      (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_WTIM0_CCP1      (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_WTIM1_CCP0      (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_6)
#  define GPIO_WTIM1_CCP1      (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_7)
#  define GPIO_WTIM2_CCP0      (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_WTIM2_CCP1      (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_WTIM3_CCP0      (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_WTIM3_CCP1      (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_WTIM4_CCP0      (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_4)
#  define GPIO_WTIM4_CCP1      (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_5)
#  define GPIO_WTIM5_CCP0      (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_WTIM5_CCP1      (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTD | GPIO_PIN_7)

#elif defined(CONFIG_ARCH_CHIP_TM4C129XNC)

#  define GPIO_ADC_AIN0        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_3)
#  define GPIO_ADC_AIN1        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_2)
#  define GPIO_ADC_AIN2        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_1)
#  define GPIO_ADC_AIN3        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_0)
#  define GPIO_ADC_AIN4        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_ADC_AIN5        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_ADC_AIN6        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_5)
#  define GPIO_ADC_AIN7        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_4)
#  define GPIO_ADC_AIN8        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_5)
#  define GPIO_ADC_AIN9        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_ADC_AIN10       (GPIO_FUNC_ANINPUT                | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_ADC_AIN11       (GPIO_FUNC_ANINPUT                | GPIO_PORTB | GPIO_PIN_5)
#  define GPIO_ADC_AIN12       (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_ADC_AIN13       (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_ADC_AIN14       (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_ADC_AIN15       (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_ADC_AIN16       (GPIO_FUNC_ANINPUT                | GPIO_PORTK | GPIO_PIN_0)
#  define GPIO_ADC_AIN17       (GPIO_FUNC_ANINPUT                | GPIO_PORTK | GPIO_PIN_1)
#  define GPIO_ADC_AIN18       (GPIO_FUNC_ANINPUT                | GPIO_PORTK | GPIO_PIN_2)
#  define GPIO_ADC_AIN19       (GPIO_FUNC_ANINPUT                | GPIO_PORTK | GPIO_PIN_3)
#  define GPIO_ADC_AIN20       (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_6)
#  define GPIO_ADC_AIN21       (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_7)
#  define GPIO_ADC_AIN22       (GPIO_FUNC_ANINPUT                | GPIO_PORTP | GPIO_PIN_7)
#  define GPIO_ADC_AIN23       (GPIO_FUNC_ANINPUT                | GPIO_PORTP | GPIO_PIN_6)

#  define GPIO_CAN0_RX_1       (GPIO_FUNC_PFINPUT  | GPIO_ALT_7  | GPIO_PORTA | GPIO_PIN_0)
#  define GPIO_CAN0_RX_2       (GPIO_FUNC_PFINPUT  | GPIO_ALT_7  | GPIO_PORTT | GPIO_PIN_0)
#  define GPIO_CAN0_TX_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_7  | GPIO_PORTA | GPIO_PIN_1)
#  define GPIO_CAN0_TX_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_7  | GPIO_PORTT | GPIO_PIN_1)
#  define GPIO_CAN1_RX_1       (GPIO_FUNC_PFINPUT  | GPIO_ALT_7  | GPIO_PORTB | GPIO_PIN_0)
#  define GPIO_CAN1_RX_2       (GPIO_FUNC_PFINPUT  | GPIO_ALT_7  | GPIO_PORTT | GPIO_PIN_2)
#  define GPIO_CAN1_TX_1       (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTB | GPIO_PIN_1)
#  define GPIO_CAN1_TX_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_7  | GPIO_PORTT | GPIO_PIN_3)

#  define GPIO_CMP0_OUT_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_CMP0_OUT_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTL | GPIO_PIN_2)
#  define GPIO_CMP1_OUT_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_CMP1_OUT_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTL | GPIO_PIN_3)
#  define GPIO_CMP2_OUT        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTD | GPIO_PIN_2)

#  define GPIO_EN0_COL         (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTM | GPIO_PIN_7)
#  define GPIO_EN0_CRS         (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTM | GPIO_PIN_6)
#  define GPIO_EN0_INTRN_1     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTK | GPIO_PIN_4)
#  define GPIO_EN0_INTRN_2     (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTP | GPIO_PIN_0)
#  define GPIO_EN0_LED0_1      (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_EN0_LED0_2      (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTK | GPIO_PIN_4)
#  define GPIO_EN0_LED1_1      (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_4)
#  define GPIO_EN0_LED1_2      (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTK | GPIO_PIN_6)
#  define GPIO_EN0_LED2_1      (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_EN0_LED2_2      (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTK | GPIO_PIN_5)
#  define GPIO_EN0_MDC_1       (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTB | GPIO_PIN_2)
#  define GPIO_EN0_MDC_2       (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_EN0_MDIO_1      (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTB | GPIO_PIN_3)
#  define GPIO_EN0_MDIO_2      (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_EN0_PPS_1       (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTG | GPIO_PIN_0)
#  define GPIO_EN0_PPS_2       (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTH | GPIO_PIN_5)
#  define GPIO_EN0_PPS_3       (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTJ | GPIO_PIN_0)
#  define GPIO_EN0_RREF_CLK    (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTM | GPIO_PIN_4)
#  define GPIO_EN0_RXCK        (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_EN0_RXD0_1      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTQ | GPIO_PIN_5)
#  define GPIO_EN0_RXD0_2      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTT | GPIO_PIN_0)
#  define GPIO_EN0_RXD1_1      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTQ | GPIO_PIN_6)
#  define GPIO_EN0_RXD1_2      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTT | GPIO_PIN_1)
#  define GPIO_EN0_RXD2        (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTK | GPIO_PIN_5)
#  define GPIO_EN0_RXD3        (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTK | GPIO_PIN_4)
#  define GPIO_EN0_RXDV_1      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTG | GPIO_PIN_7)
#  define GPIO_EN0_RXDV_2      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTS | GPIO_PIN_7)
#  define GPIO_EN0_RXER_1      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTG | GPIO_PIN_6)
#  define GPIO_EN0_RXER_2      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTS | GPIO_PIN_6)
#  define GPIO_EN0_TXCK        (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTG | GPIO_PIN_2)
#  define GPIO_EN0_TXD0_1      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTG | GPIO_PIN_4)
#  define GPIO_EN0_TXD0_2      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTS | GPIO_PIN_4)
#  define GPIO_EN0_TXD1_1      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTG | GPIO_PIN_5)
#  define GPIO_EN0_TXD1_2      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTS | GPIO_PIN_5)
#  define GPIO_EN0_TXD2        (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTK | GPIO_PIN_6)
#  define GPIO_EN0_TXD3        (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTK | GPIO_PIN_7)
#  define GPIO_EN0_TXEN_1      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTG | GPIO_PIN_3)
#  define GPIO_EN0_TXEN_2      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTR | GPIO_PIN_7)
#  define GPIO_EN0_TXER        (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTN | GPIO_PIN_6)

