apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c_pinmap.h
#  define GPIO_EPI0_S0_1       (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTH | GPIO_PIN_0)
#  define GPIO_EPI0_S0_2       (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTK | GPIO_PIN_0)
#  define GPIO_EPI0_S1_1       (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTH | GPIO_PIN_1)
#  define GPIO_EPI0_S1_2       (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTK | GPIO_PIN_1)
#  define GPIO_EPI0_S2_1       (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTH | GPIO_PIN_2)
#  define GPIO_EPI0_S2_2       (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTK | GPIO_PIN_2)
#  define GPIO_EPI0_S3_1       (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTH | GPIO_PIN_3)
#  define GPIO_EPI0_S3_2       (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTK | GPIO_PIN_3)
#  define GPIO_EPI0_S4         (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTC | GPIO_PIN_7)
#  define GPIO_EPI0_S5         (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTC | GPIO_PIN_6)
#  define GPIO_EPI0_S6         (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_EPI0_S7         (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_EPI0_S8         (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_EPI0_S9         (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTA | GPIO_PIN_7)
#  define GPIO_EPI0_S10        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTG | GPIO_PIN_1)
#  define GPIO_EPI0_S11        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTG | GPIO_PIN_0)
#  define GPIO_EPI0_S12        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTM | GPIO_PIN_3)
#  define GPIO_EPI0_S13        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTM | GPIO_PIN_2)
#  define GPIO_EPI0_S14        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTM | GPIO_PIN_1)
#  define GPIO_EPI0_S15        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTM | GPIO_PIN_0)
#  define GPIO_EPI0_S16        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTL | GPIO_PIN_0)
#  define GPIO_EPI0_S17        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTL | GPIO_PIN_1)
#  define GPIO_EPI0_S18        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTL | GPIO_PIN_2)
#  define GPIO_EPI0_S19        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTL | GPIO_PIN_3)
#  define GPIO_EPI0_S20        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTQ | GPIO_PIN_0)
#  define GPIO_EPI0_S21        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTQ | GPIO_PIN_1)
#  define GPIO_EPI0_S22        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTQ | GPIO_PIN_2)
#  define GPIO_EPI0_S23        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTQ | GPIO_PIN_3)
#  define GPIO_EPI0_S24        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTK | GPIO_PIN_7)
#  define GPIO_EPI0_S25        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTK | GPIO_PIN_6)
#  define GPIO_EPI0_S26        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTL | GPIO_PIN_4)
#  define GPIO_EPI0_S27        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTB | GPIO_PIN_2)
#  define GPIO_EPI0_S28        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTB | GPIO_PIN_3)
#  define GPIO_EPI0_S29_1      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTN | GPIO_PIN_2)
#  define GPIO_EPI0_S29_2      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTP | GPIO_PIN_2)
#  define GPIO_EPI0_S30_1      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTN | GPIO_PIN_3)
#  define GPIO_EPI0_S30_2      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTP | GPIO_PIN_3)
#  define GPIO_EPI0_S31        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTK | GPIO_PIN_5)
#  define GPIO_EPI0_S32        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTK | GPIO_PIN_4)
#  define GPIO_EPI0_S33        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTL | GPIO_PIN_5)
#  define GPIO_EPI0_S34        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTN | GPIO_PIN_4)
#  define GPIO_EPI0_S35        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTN | GPIO_PIN_5)

#  define GPIO_I2C0_SCL        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_2)
#  define GPIO_I2C0_SDA        (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_3 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C1_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTG | GPIO_PIN_0)
#  define GPIO_I2C1_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTR | GPIO_PIN_0)
#  define GPIO_I2C1_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTG | GPIO_PIN_1 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C1_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTR | GPIO_PIN_1 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C2_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTG | GPIO_PIN_2)
#  define GPIO_I2C2_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTL | GPIO_PIN_1)
#  define GPIO_I2C2_SCL_3      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTP | GPIO_PIN_5)
#  define GPIO_I2C2_SCL_4      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTR | GPIO_PIN_2)
#  define GPIO_I2C2_SCL_5      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTN | GPIO_PIN_5)
#  define GPIO_I2C2_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTG | GPIO_PIN_3 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C2_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTL | GPIO_PIN_0 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C2_SDA_3      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTP | GPIO_PIN_6 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C2_SDA_4      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTR | GPIO_PIN_3 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C2_SDA_5      (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTN | GPIO_PIN_4 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C3_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTG | GPIO_PIN_4)
#  define GPIO_I2C3_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTK | GPIO_PIN_4)
#  define GPIO_I2C3_SCL_3      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTR | GPIO_PIN_4)
#  define GPIO_I2C3_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTG | GPIO_PIN_5 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C3_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTK | GPIO_PIN_5 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C3_SDA_3      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTR | GPIO_PIN_5 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C4_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTG | GPIO_PIN_6)
#  define GPIO_I2C4_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTK | GPIO_PIN_6)
#  define GPIO_I2C4_SCL_3      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTR | GPIO_PIN_6)
#  define GPIO_I2C4_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTG | GPIO_PIN_7 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C4_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTK | GPIO_PIN_7 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C4_SDA_3      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTR | GPIO_PIN_7 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C5_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_0)
#  define GPIO_I2C5_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_I2C5_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_1 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C5_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_5 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C6_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_I2C6_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_6)
#  define GPIO_I2C6_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_7 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C6_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_7 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C7_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_4)
#  define GPIO_I2C7_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_I2C7_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_5 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C7_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTD | GPIO_PIN_1 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C8_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_2)
#  define GPIO_I2C8_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_I2C8_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_3 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C8_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTD | GPIO_PIN_3 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C9_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_0)
#  define GPIO_I2C9_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTE | GPIO_PIN_6)
#  define GPIO_I2C9_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_1 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C9_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTE | GPIO_PIN_7 | GPIO_PADTYPE_ODWPU)

#  define GPIO_JTAG_SWCLK      (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_0)
#  define GPIO_JTAG_SWDIO      (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_1)
#  define GPIO_JTAG_SWO        (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_3)
#  define GPIO_JTAG_TCK        (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_0)
#  define GPIO_JTAG_TDI        (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_2)
#  define GPIO_JTAG_TDO        (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_3)
#  define GPIO_JTAG_TMS        (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_1)

#  define GPIO_LCD_AC          (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTJ | GPIO_PIN_6)
#  define GPIO_LCD_CP          (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTR | GPIO_PIN_0)
#  define GPIO_LCD_DATA00      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTR | GPIO_PIN_4)
#  define GPIO_LCD_DATA01      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTR | GPIO_PIN_5)
#  define GPIO_LCD_DATA02      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_7)
#  define GPIO_LCD_DATA03      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTR | GPIO_PIN_3)
#  define GPIO_LCD_DATA04      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTR | GPIO_PIN_6)
#  define GPIO_LCD_DATA05      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTR | GPIO_PIN_7)
#  define GPIO_LCD_DATA06      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTS | GPIO_PIN_4)
#  define GPIO_LCD_DATA07      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTS | GPIO_PIN_5)
#  define GPIO_LCD_DATA08      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTS | GPIO_PIN_6)
#  define GPIO_LCD_DATA09      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTS | GPIO_PIN_7)
#  define GPIO_LCD_DATA10      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTT | GPIO_PIN_0)
#  define GPIO_LCD_DATA11      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTT | GPIO_PIN_1)
#  define GPIO_LCD_DATA12      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTN | GPIO_PIN_7)
#  define GPIO_LCD_DATA13      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTN | GPIO_PIN_6)
#  define GPIO_LCD_DATA14      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTJ | GPIO_PIN_2)
#  define GPIO_LCD_DATA15      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTJ | GPIO_PIN_3)
#  define GPIO_LCD_DATA16      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTJ | GPIO_PIN_4)
#  define GPIO_LCD_DATA17      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTJ | GPIO_PIN_5)
#  define GPIO_LCD_DATA18      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTT | GPIO_PIN_2)
#  define GPIO_LCD_DATA19      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTT | GPIO_PIN_3)
#  define GPIO_LCD_DATA20      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTS | GPIO_PIN_0)
#  define GPIO_LCD_DATA21      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTS | GPIO_PIN_1)
#  define GPIO_LCD_DATA22      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTS | GPIO_PIN_2)
#  define GPIO_LCD_DATA23      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTS | GPIO_PIN_3)
#  define GPIO_LCD_FP          (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTR | GPIO_PIN_1)
#  define GPIO_LCD_LP          (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTR | GPIO_PIN_2)
#  define GPIO_LCD_MCLK        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_6)

#  define GPIO_M0_PWM_FAULT0_1 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_4)
#  define GPIO_M0_PWM_FAULT0_2 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTS | GPIO_PIN_0)
#  define GPIO_M0_PWM_FAULT1_1 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_6)
#  define GPIO_M0_PWM_FAULT1_2 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTS | GPIO_PIN_1)
#  define GPIO_M0_PWM_FAULT2_1 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_7)
#  define GPIO_M0_PWM_FAULT2_2 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTS | GPIO_PIN_2)
#  define GPIO_M0_PWM_FAULT3_1 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTL | GPIO_PIN_0)
#  define GPIO_M0_PWM_FAULT3_2 (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTS | GPIO_PIN_3)
#  define GPIO_M0_PWM0_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_M0_PWM0_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTR | GPIO_PIN_0)
#  define GPIO_M0_PWM1_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_M0_PWM1_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTR | GPIO_PIN_1)
#  define GPIO_M0_PWM2_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_M0_PWM2_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTR | GPIO_PIN_2)
#  define GPIO_M0_PWM3_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_M0_PWM3_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTR | GPIO_PIN_3)
#  define GPIO_M0_PWM4_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTG | GPIO_PIN_0)
#  define GPIO_M0_PWM4_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTR | GPIO_PIN_4)
#  define GPIO_M0_PWM5_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTG | GPIO_PIN_1)
#  define GPIO_M0_PWM5_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTR | GPIO_PIN_5)
#  define GPIO_M0_PWM6_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_4)
#  define GPIO_M0_PWM6_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTR | GPIO_PIN_6)
#  define GPIO_M0_PWM7_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_5)
#  define GPIO_M0_PWM7_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTR | GPIO_PIN_7)

#  define GPIO_NMI_1           (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_NMI_2           (GPIO_FUNC_PFIO     | GPIO_ALT_8  | GPIO_PORTE | GPIO_PIN_7)

#  define GPIO_OWALT_1         (GPIO_FUNC_PFIO     | GPIO_ALT_4  | GPIO_PORTP | GPIO_PIN_5)
#  define GPIO_OWALT_2         (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTG | GPIO_PIN_5)
#  define GPIO_OWIRE_1         (GPIO_FUNC_PFIO     | GPIO_ALT_4  | GPIO_PORTP | GPIO_PIN_4)
#  define GPIO_OWIRE_2         (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTE | GPIO_PIN_3)
#  define GPIO_OWIRE_3         (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTG | GPIO_PIN_4)
#  define GPIO_OWIRE_4         (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTG | GPIO_PIN_6)
#  define GPIO_OWIRE_5         (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTG | GPIO_PIN_7)
#  define GPIO_OWIRE_6         (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTP | GPIO_PIN_7)

#  define GPIO_QEI0_IDX_1      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTL | GPIO_PIN_3)
#  define GPIO_QEI0_IDX_2      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTS | GPIO_PIN_6)
#  define GPIO_QEI0_PHA_1      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTL | GPIO_PIN_1)
#  define GPIO_QEI0_PHA_2      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTS | GPIO_PIN_4)
#  define GPIO_QEI0_PHB_1      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTL | GPIO_PIN_2)
#  define GPIO_QEI0_PHB_2      (GPIO_FUNC_PFIO     | GPIO_ALT_6  | GPIO_PORTS | GPIO_PIN_5)

