apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c_pinmap.h
#  define GPIO_SSI0_CLK        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTA | GPIO_PIN_2)
#  define GPIO_SSI0_FSS        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTA | GPIO_PIN_3)
#  define GPIO_SSI0_XDAT0      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTA | GPIO_PIN_4)
#  define GPIO_SSI0_XDAT1      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTA | GPIO_PIN_5)
#  define GPIO_SSI0_XDAT2      (GPIO_FUNC_PFIO     | GPIO_ALT_12 | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_SSI0_XDAT3      (GPIO_FUNC_PFIO     | GPIO_ALT_12 | GPIO_PORTA | GPIO_PIN_7)
#  define GPIO_SSI1_CLK        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTB | GPIO_PIN_5)
#  define GPIO_SSI1_FSS        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_SSI1_XDAT0      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_SSI1_XDAT1      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTE | GPIO_PIN_5)
#  define GPIO_SSI1_XDAT2      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTD | GPIO_PIN_4)
#  define GPIO_SSI1_XDAT3      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTD | GPIO_PIN_5)
#  define GPIO_SSI2_CLK_1      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_SSI2_CLK_2      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTG | GPIO_PIN_7)
#  define GPIO_SSI2_FSS_1      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_SSI2_FSS_2      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTG | GPIO_PIN_6)
#  define GPIO_SSI2_XDAT0_1    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_SSI2_XDAT0_2    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTG | GPIO_PIN_5)
#  define GPIO_SSI2_XDAT1_1    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_SSI2_XDAT1_2    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTG | GPIO_PIN_4)
#  define GPIO_SSI2_XDAT2_1    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_SSI2_XDAT2_2    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTG | GPIO_PIN_3)
#  define GPIO_SSI2_XDAT3_1    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_SSI2_XDAT3_2    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTG | GPIO_PIN_2)
#  define GPIO_SSI3_CLK_1      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_SSI3_CLK_2      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTQ | GPIO_PIN_0)
#  define GPIO_SSI3_FSS_1      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_SSI3_FSS_2      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTQ | GPIO_PIN_1)
#  define GPIO_SSI3_XDAT0_1    (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_SSI3_XDAT0_2    (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTQ | GPIO_PIN_2)
#  define GPIO_SSI3_XDAT1_1    (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_SSI3_XDAT1_2    (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTQ | GPIO_PIN_3)
#  define GPIO_SSI3_XDAT2_1    (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTF | GPIO_PIN_4)
#  define GPIO_SSI3_XDAT2_2    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTP | GPIO_PIN_0)
#  define GPIO_SSI3_XDAT3_1    (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTF | GPIO_PIN_5)
#  define GPIO_SSI3_XDAT3_2    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTP | GPIO_PIN_1)

#  define GPIO_SYSCON_DIVSCLK  (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTQ | GPIO_PIN_4)

#  define GPIO_TR_CLK          (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_TR_D0           (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_TR_D1           (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_TR_D2           (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_TR_D3           (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_4)

#  define GPIO_TIM0_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_0)
#  define GPIO_TIM0_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_TIM0_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTL | GPIO_PIN_4)
#  define GPIO_TIM0_CCP0_4     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTR | GPIO_PIN_4)
#  define GPIO_TIM0_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_1)
#  define GPIO_TIM0_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_TIM0_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTL | GPIO_PIN_5)
#  define GPIO_TIM0_CCP1_4     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTR | GPIO_PIN_5)
#  define GPIO_TIM1_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_2)
#  define GPIO_TIM1_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_TIM1_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTL | GPIO_PIN_6)
#  define GPIO_TIM1_CCP0_4     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTR | GPIO_PIN_6)
#  define GPIO_TIM1_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_3)
#  define GPIO_TIM1_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_TIM1_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTL | GPIO_PIN_7)
#  define GPIO_TIM1_CCP1_4     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTR | GPIO_PIN_7)
#  define GPIO_TIM2_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_4)
#  define GPIO_TIM2_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_0)
#  define GPIO_TIM2_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTS | GPIO_PIN_0)
#  define GPIO_TIM2_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_5)
#  define GPIO_TIM2_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_1)
#  define GPIO_TIM2_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTS | GPIO_PIN_1)
#  define GPIO_TIM3_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_TIM3_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_4)
#  define GPIO_TIM3_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_2)
#  define GPIO_TIM3_CCP0_4     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTS | GPIO_PIN_2)
#  define GPIO_TIM3_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_7)
#  define GPIO_TIM3_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_5)
#  define GPIO_TIM3_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_3)
#  define GPIO_TIM3_CCP1_4     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTS | GPIO_PIN_3)
#  define GPIO_TIM4_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_0)
#  define GPIO_TIM4_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_TIM4_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_4)
#  define GPIO_TIM4_CCP0_4     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTS | GPIO_PIN_4)
#  define GPIO_TIM4_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_1)
#  define GPIO_TIM4_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_TIM4_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_5)
#  define GPIO_TIM4_CCP1_4     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTS | GPIO_PIN_5)
#  define GPIO_TIM5_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_2)
#  define GPIO_TIM5_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_6)
#  define GPIO_TIM5_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTS | GPIO_PIN_6)
#  define GPIO_TIM5_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_3)
#  define GPIO_TIM5_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_7)
#  define GPIO_TIM5_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTS | GPIO_PIN_7)
#  define GPIO_TIM6_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_6)
#  define GPIO_TIM6_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTQ | GPIO_PIN_0)
#  define GPIO_TIM6_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTT | GPIO_PIN_0)
#  define GPIO_TIM6_CCP0_4     (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTP | GPIO_PIN_0)
#  define GPIO_TIM6_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_7)
#  define GPIO_TIM6_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTQ | GPIO_PIN_1)
#  define GPIO_TIM6_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTT | GPIO_PIN_1)
#  define GPIO_TIM6_CCP1_4     (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTP | GPIO_PIN_1)
#  define GPIO_TIM7_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_TIM7_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTQ | GPIO_PIN_2)
#  define GPIO_TIM7_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTT | GPIO_PIN_2)
#  define GPIO_TIM7_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_TIM7_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTQ | GPIO_PIN_3)
#  define GPIO_TIM7_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTT | GPIO_PIN_3)

