apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c_pinmap.h
#  define GPIO_UART0_CTS_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_UART0_CTS_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_6)
#  define GPIO_UART0_CTS_3     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTG | GPIO_PIN_4)
#  define GPIO_UART0_CTS_4     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTH | GPIO_PIN_1)
#  define GPIO_UART0_CTS_5     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTM | GPIO_PIN_4)
#  define GPIO_UART0_DCD_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTH | GPIO_PIN_2)
#  define GPIO_UART0_DCD_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTM | GPIO_PIN_5)
#  define GPIO_UART0_DCD_3     (GPIO_FUNC_PFINPUT  | GPIO_ALT_2  | GPIO_PORTP | GPIO_PIN_3)
#  define GPIO_UART0_DSR_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTH | GPIO_PIN_3)
#  define GPIO_UART0_DSR_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTM | GPIO_PIN_6)
#  define GPIO_UART0_DSR_3     (GPIO_FUNC_PFINPUT  | GPIO_ALT_2  | GPIO_PORTP | GPIO_PIN_4)
#  define GPIO_UART0_DTR_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTH | GPIO_PIN_4)
#  define GPIO_UART0_DTR_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_2)
#  define GPIO_UART0_RI_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTH | GPIO_PIN_5)
#  define GPIO_UART0_RI_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTK | GPIO_PIN_7)
#  define GPIO_UART0_RI_3      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTM | GPIO_PIN_7)
#  define GPIO_UART0_RTS_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTB | GPIO_PIN_5)
#  define GPIO_UART0_RTS_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_7)
#  define GPIO_UART0_RTS_3     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTG | GPIO_PIN_5)
#  define GPIO_UART0_RTS_4     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTH | GPIO_PIN_0)
#  define GPIO_UART0_RX        (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_0)
#  define GPIO_UART0_TX        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_1)
#  define GPIO_UART1_CTS_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_1)
#  define GPIO_UART1_CTS_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_3)
#  define GPIO_UART1_DCD_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_2)
#  define GPIO_UART1_DCD_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_2)
#  define GPIO_UART1_DCD_3     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_6)
#  define GPIO_UART1_DSR_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_1)
#  define GPIO_UART1_DSR_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_3)
#  define GPIO_UART1_DSR_3     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTS | GPIO_PIN_2)
#  define GPIO_UART1_DTR_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_3)
#  define GPIO_UART1_DTR_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_4)
#  define GPIO_UART1_DTR_3     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTQ | GPIO_PIN_6)
#  define GPIO_UART1_RI_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_UART1_RI_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_5)
#  define GPIO_UART1_RI_3      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTQ | GPIO_PIN_7)
#  define GPIO_UART1_RTS_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_0)
#  define GPIO_UART1_RTS_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_0)
#  define GPIO_UART1_RTS_3     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_7)
#  define GPIO_UART1_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTB | GPIO_PIN_0)
#  define GPIO_UART1_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTQ | GPIO_PIN_4)
#  define GPIO_UART1_RX_3      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTR | GPIO_PIN_5)
#  define GPIO_UART1_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTB | GPIO_PIN_1)
#  define GPIO_UART1_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTQ | GPIO_PIN_5)
#  define GPIO_UART1_TX_3      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTR | GPIO_PIN_6)
#  define GPIO_UART2_CTS_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_UART2_CTS_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_3)
#  define GPIO_UART2_CTS_3     (GPIO_FUNC_PFINPUT  | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_3)
#  define GPIO_UART2_RTS_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_UART2_RTS_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_2)
#  define GPIO_UART2_RTS_3     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_2)
#  define GPIO_UART2_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_UART2_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_4)
#  define GPIO_UART2_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_7)
#  define GPIO_UART2_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_5)
#  define GPIO_UART3_CTS_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_5)
#  define GPIO_UART3_CTS_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_5)
#  define GPIO_UART3_CTS_3     (GPIO_FUNC_PFINPUT  | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_5)
#  define GPIO_UART3_RTS_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_4)
#  define GPIO_UART3_RTS_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_4)
#  define GPIO_UART3_RTS_3     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_4)
#  define GPIO_UART3_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_4)
#  define GPIO_UART3_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_0)
#  define GPIO_UART3_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_5)
#  define GPIO_UART3_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_1)
#  define GPIO_UART4_CTS_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTK | GPIO_PIN_3)
#  define GPIO_UART4_CTS_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_7)
#  define GPIO_UART4_CTS_3     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_7)
#  define GPIO_UART4_RTS_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_6)
#  define GPIO_UART4_RTS_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTK | GPIO_PIN_2)
#  define GPIO_UART4_RTS_3     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_6)
#  define GPIO_UART4_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_2)
#  define GPIO_UART4_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTK | GPIO_PIN_0)
#  define GPIO_UART4_RX_3      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTR | GPIO_PIN_1)
#  define GPIO_UART4_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_3)
#  define GPIO_UART4_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTK | GPIO_PIN_1)
#  define GPIO_UART4_TX_3      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTR | GPIO_PIN_0)
#  define GPIO_UART5_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_6)
#  define GPIO_UART5_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTH | GPIO_PIN_6)
#  define GPIO_UART5_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_7)
#  define GPIO_UART5_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTH | GPIO_PIN_7)
#  define GPIO_UART6_RX        (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_0)
#  define GPIO_UART6_TX        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_1)
#  define GPIO_UART7_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_UART7_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_2  | GPIO_PORTH | GPIO_PIN_6)
#  define GPIO_UART7_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_UART7_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTH | GPIO_PIN_7)

#  define GPIO_USB0_CLK        (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTB | GPIO_PIN_3)
#  define GPIO_USB0_D0         (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTL | GPIO_PIN_0)
#  define GPIO_USB0_D1         (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTL | GPIO_PIN_1)
#  define GPIO_USB0_D2         (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTL | GPIO_PIN_2)
#  define GPIO_USB0_D3         (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTL | GPIO_PIN_3)
#  define GPIO_USB0_D4         (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTL | GPIO_PIN_4)
#  define GPIO_USB0_D5         (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTL | GPIO_PIN_5)
#  define GPIO_USB0_D6         (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTP | GPIO_PIN_5)
#  define GPIO_USB0_D7         (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTP | GPIO_PIN_4)
#  define GPIO_USB0_DIR        (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTP | GPIO_PIN_3)
#  define GPIO_USB0_EPEN_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_11 | GPIO_PORTA | GPIO_PIN_7)
#  define GPIO_USB0_EPEN_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_USB0_EPEN_3     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_USB0_ID         (GPIO_FUNC_ANINPUT                | GPIO_PORTB | GPIO_PIN_0)
#  define GPIO_USB0_NXT        (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTP | GPIO_PIN_2)
#  define GPIO_USB0_PFLT_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_5  | GPIO_PORTA | GPIO_PIN_7)
#  define GPIO_USB0_PFLT_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_5  | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_USB0_STP        (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTB | GPIO_PIN_2)
#  define GPIO_USB0_VBUS       (GPIO_FUNC_ANIO                   | GPIO_PORTB | GPIO_PIN_1)

#  define GPIO_RTC_CLK_1       (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTK | GPIO_PIN_7)
#  define GPIO_RTC_CLK_2       (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_RTC_CLK_3       (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTP | GPIO_PIN_3)

