apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c_pinmap.h
#elif defined(CONFIG_ARCH_CHIP_TM4C1294NC)
#  define GPIO_ADC_AIN0        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_3)
#  define GPIO_ADC_AIN1        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_2)
#  define GPIO_ADC_AIN2        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_1)
#  define GPIO_ADC_AIN3        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_0)
#  define GPIO_ADC_AIN4        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_ADC_AIN5        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_ADC_AIN6        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_5)
#  define GPIO_ADC_AIN7        (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_4)
#  define GPIO_ADC_AIN8        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_5)
#  define GPIO_ADC_AIN9        (GPIO_FUNC_ANINPUT                | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_ADC_AIN10       (GPIO_FUNC_ANINPUT                | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_ADC_AIN11       (GPIO_FUNC_ANINPUT                | GPIO_PORTB | GPIO_PIN_5)
#  define GPIO_ADC_AIN12       (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_ADC_AIN13       (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_ADC_AIN14       (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_ADC_AIN15       (GPIO_FUNC_ANINPUT                | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_ADC_AIN16       (GPIO_FUNC_ANINPUT                | GPIO_PORTK | GPIO_PIN_0)
#  define GPIO_ADC_AIN17       (GPIO_FUNC_ANINPUT                | GPIO_PORTK | GPIO_PIN_1)
#  define GPIO_ADC_AIN18       (GPIO_FUNC_ANINPUT                | GPIO_PORTK | GPIO_PIN_2)
#  define GPIO_ADC_AIN19       (GPIO_FUNC_ANINPUT                | GPIO_PORTK | GPIO_PIN_3)

#  define GPIO_CAN0_RX         (GPIO_FUNC_PFINPUT  | GPIO_ALT_7  | GPIO_PORTA | GPIO_PIN_0)
#  define GPIO_CAN0_TX         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_7  | GPIO_PORTA | GPIO_PIN_1)
#  define GPIO_CAN1_RX         (GPIO_FUNC_PFINPUT  | GPIO_ALT_7  | GPIO_PORTB | GPIO_PIN_0)
#  define GPIO_CAN1_TX         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_7  | GPIO_PORTB | GPIO_PIN_1)

#  define GPIO_CMP0_PIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTC | GPIO_PIN_6)
#  define GPIO_CMP0_NIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTC | GPIO_PIN_7)
#  define GPIO_CMP0_OUT_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_CMP0_OUT_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTL | GPIO_PIN_2)
#  define GPIO_CMP1_PIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_CMP1_NIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_CMP1_OUT_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_CMP1_OUT_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTL | GPIO_PIN_3)
#  define GPIO_CMP2_PIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTP | GPIO_PIN_0)
#  define GPIO_CMP2_NIN        (GPIO_FUNC_ANINPUT                | GPIO_PORTP | GPIO_PIN_1)
#  define GPIO_CMP2_OUT        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTD | GPIO_PIN_2)

#  define GPIO_EN0_LED0_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_EN0_LED0_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTK | GPIO_PIN_4)
#  define GPIO_EN0_LED1_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_4)
#  define GPIO_EN0_LED1_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTK | GPIO_PIN_6)
#  define GPIO_EN0_LED2_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_EN0_LED2_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTK | GPIO_PIN_5)
#  define GPIO_EN0_PPS_1       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTG | GPIO_PIN_0)
#  define GPIO_EN0_PPS_2       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTJ | GPIO_PIN_0)

#  define GPIO_EPI0_S0_1       (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTH | GPIO_PIN_0)
#  define GPIO_EPI0_S0_2       (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTK | GPIO_PIN_0)
#  define GPIO_EPI0_S1_1       (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTH | GPIO_PIN_1)
#  define GPIO_EPI0_S1_2       (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTK | GPIO_PIN_1)
#  define GPIO_EPI0_S2_1       (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTH | GPIO_PIN_2)
#  define GPIO_EPI0_S2_2       (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTK | GPIO_PIN_2)
#  define GPIO_EPI0_S3_1       (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTH | GPIO_PIN_3)
#  define GPIO_EPI0_S3_2       (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTK | GPIO_PIN_3)
#  define GPIO_EPI0_S4         (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTC | GPIO_PIN_7)
#  define GPIO_EPI0_S5         (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTC | GPIO_PIN_6)
#  define GPIO_EPI0_S6         (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_EPI0_S7         (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_EPI0_S8         (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_EPI0_S9         (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTA | GPIO_PIN_7)
#  define GPIO_EPI0_S10        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTG | GPIO_PIN_1)
#  define GPIO_EPI0_S11        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTG | GPIO_PIN_0)
#  define GPIO_EPI0_S12        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTM | GPIO_PIN_3)
#  define GPIO_EPI0_S13        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTM | GPIO_PIN_2)
#  define GPIO_EPI0_S14        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTM | GPIO_PIN_1)
#  define GPIO_EPI0_S15        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTM | GPIO_PIN_0)
#  define GPIO_EPI0_S16        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTL | GPIO_PIN_0)
#  define GPIO_EPI0_S17        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTL | GPIO_PIN_1)
#  define GPIO_EPI0_S18        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTL | GPIO_PIN_2)
#  define GPIO_EPI0_S19        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTL | GPIO_PIN_3)
#  define GPIO_EPI0_S20        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTQ | GPIO_PIN_0)
#  define GPIO_EPI0_S21        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTQ | GPIO_PIN_1)
#  define GPIO_EPI0_S22        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTQ | GPIO_PIN_2)
#  define GPIO_EPI0_S23        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTQ | GPIO_PIN_3)
#  define GPIO_EPI0_S24        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTK | GPIO_PIN_7)
#  define GPIO_EPI0_S25        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTK | GPIO_PIN_6)
#  define GPIO_EPI0_S26        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTL | GPIO_PIN_4)
#  define GPIO_EPI0_S27        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTB | GPIO_PIN_2)
#  define GPIO_EPI0_S28        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTB | GPIO_PIN_3)
#  define GPIO_EPI0_S29_1      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTN | GPIO_PIN_2)
#  define GPIO_EPI0_S29_2      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTP | GPIO_PIN_2)
#  define GPIO_EPI0_S30_1      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTN | GPIO_PIN_3)
#  define GPIO_EPI0_S30_2      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTP | GPIO_PIN_3)
#  define GPIO_EPI0_S31        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTK | GPIO_PIN_5)
#  define GPIO_EPI0_S32        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTK | GPIO_PIN_4)
#  define GPIO_EPI0_S33        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTL | GPIO_PIN_5)
#  define GPIO_EPI0_S34        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTN | GPIO_PIN_4)
#  define GPIO_EPI0_S35        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTN | GPIO_PIN_5)

#  define GPIO_HIB_RTCCLK_1    (GPIO_FUNC_PFOUTPUT | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_HIB_RTCCLK_2    (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTK | GPIO_PIN_7)
#  define GPIO_HIB_RTCCLK_3    (GPIO_FUNC_PFOUTPUT | GPIO_ALT_7  | GPIO_PORTP | GPIO_PIN_3)

#  define GPIO_I2C0_SCL        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_2)
#  define GPIO_I2C0_SDA        (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_3 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C1_SCL        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTG | GPIO_PIN_0)
#  define GPIO_I2C1_SDA        (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTG | GPIO_PIN_1 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C2_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTL | GPIO_PIN_1)
#  define GPIO_I2C2_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTP | GPIO_PIN_5)
#  define GPIO_I2C2_SCL_3      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_3  | GPIO_PORTN | GPIO_PIN_5)
#  define GPIO_I2C2_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTL | GPIO_PIN_0 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C2_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_3  | GPIO_PORTN | GPIO_PIN_4 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C3_SCL        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTK | GPIO_PIN_4)
#  define GPIO_I2C3_SDA        (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTK | GPIO_PIN_5 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C4_SCL        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTK | GPIO_PIN_6)
#  define GPIO_I2C4_SDA        (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTK | GPIO_PIN_7 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C5_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_0)
#  define GPIO_I2C5_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_I2C5_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_1 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C5_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTB | GPIO_PIN_5 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C6_SCL        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_I2C6_SDA        (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_7 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C7_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_I2C7_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_4)
#  define GPIO_I2C7_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTD | GPIO_PIN_1 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C7_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_5 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C8_SCL_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_I2C8_SCL_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_2)
#  define GPIO_I2C8_SDA_1      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTD | GPIO_PIN_3 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C8_SDA_2      (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_3 | GPIO_PADTYPE_ODWPU)
#  define GPIO_I2C9_SCL        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_0)
#  define GPIO_I2C9_SDA        (GPIO_FUNC_PFODIO   | GPIO_ALT_2  | GPIO_PORTA | GPIO_PIN_1 | GPIO_PADTYPE_ODWPU)

#  define GPIO_JTAG_SWCLK      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_0)
#  define GPIO_JTAG_SWDIO      (GPIO_FUNC_PFIO     | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_1)
#  define GPIO_JTAG_SWO        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_3)
#  define GPIO_JTAG_TCK        (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_0)
#  define GPIO_JTAG_TDI        (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_2)
#  define GPIO_JTAG_TDO        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_3)
#  define GPIO_JTAG_TMS        (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_1)

#  define GPIO_M0_PWM_FAULT0   (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_4)
#  define GPIO_M0_PWM_FAULT1   (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_6)
#  define GPIO_M0_PWM_FAULT2   (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_7)
#  define GPIO_M0_PWM_FAULT3   (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTL | GPIO_PIN_0)
#  define GPIO_M0_PWM0         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_M0_PWM1         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_M0_PWM2         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_M0_PWM3         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_M0_PWM4         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTG | GPIO_PIN_0)
#  define GPIO_M0_PWM5         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTG | GPIO_PIN_1)
#  define GPIO_M0_PWM6         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_4)
#  define GPIO_M0_PWM7         (GPIO_FUNC_PFOUTPUT | GPIO_ALT_6  | GPIO_PORTK | GPIO_PIN_5)

#  define GPIO_NMI             (GPIO_FUNC_PFINPUT  | GPIO_ALT_8  | GPIO_PORTD | GPIO_PIN_7)

#  define GPIO_QEI0_IDX        (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTL | GPIO_PIN_3)
#  define GPIO_QEI0_PHA        (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTL | GPIO_PIN_1)
#  define GPIO_QEI0_PHB        (GPIO_FUNC_PFINPUT  | GPIO_ALT_6  | GPIO_PORTL | GPIO_PIN_2)

#  define GPIO_RTC_CLK_1       (GPIO_FUNC_PFIO     | GPIO_ALT_5  | GPIO_PORTK | GPIO_PIN_7)
#  define GPIO_RTC_CLK_2       (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTC | GPIO_PIN_5)
#  define GPIO_RTC_CLK_3       (GPIO_FUNC_PFIO     | GPIO_ALT_7  | GPIO_PORTP | GPIO_PIN_3)

#  define GPIO_SSI0_CLK        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTA | GPIO_PIN_2)
#  define GPIO_SSI0_FSS        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTA | GPIO_PIN_3)
#  define GPIO_SSI0_TX         (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTA | GPIO_PIN_4)
#  define GPIO_SSI0_XDAT0      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTA | GPIO_PIN_4)
#  define GPIO_SSI0_RX         (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTA | GPIO_PIN_5)
#  define GPIO_SSI0_XDAT1      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTA | GPIO_PIN_5)
#  define GPIO_SSI0_XDAT2      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_SSI0_XDAT3      (GPIO_FUNC_PFIO     | GPIO_ALT_13 | GPIO_PORTA | GPIO_PIN_7)
#  define GPIO_SSI1_CLK        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTB | GPIO_PIN_5)
#  define GPIO_SSI1_FSS        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_SSI1_TX         (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_SSI1_XDAT0      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_SSI1_RX         (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTE | GPIO_PIN_5)
#  define GPIO_SSI1_XDAT1      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTE | GPIO_PIN_5)
#  define GPIO_SSI1_XDAT2      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTD | GPIO_PIN_4)
#  define GPIO_SSI1_XDAT3      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTD | GPIO_PIN_5)
#  define GPIO_SSI2_CLK        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_SSI2_FSS        (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_SSI2_TX         (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_SSI2_XDAT0      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_SSI2_RX         (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_SSI2_XDAT1      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_SSI2_XDAT2      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_SSI2_XDAT3      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_SSI3_CLK_1      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_SSI3_CLK_2      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTQ | GPIO_PIN_0)
#  define GPIO_SSI3_FSS_1      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_SSI3_FSS_2      (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTQ | GPIO_PIN_1)
#  define GPIO_SSI3_TX_1       (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_SSI3_TX_2       (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTQ | GPIO_PIN_2)
#  define GPIO_SSI3_XDAT0_1    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_SSI3_XDAT0_2    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTQ | GPIO_PIN_2)
#  define GPIO_SSI3_RX_1       (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_SSI3_RX_2       (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTQ | GPIO_PIN_3)
#  define GPIO_SSI3_XDAT1_1    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_SSI3_XDAT1_2    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTQ | GPIO_PIN_3)
#  define GPIO_SSI3_XDAT2_1    (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTF | GPIO_PIN_4)
#  define GPIO_SSI3_XDAT2_2    (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTP | GPIO_PIN_0)
#  define GPIO_SSI3_XDAT3      (GPIO_FUNC_PFIO     | GPIO_ALT_15 | GPIO_PORTP | GPIO_PIN_1)

#  define GPIO_SYSCON_DIVSCLK  (GPIO_FUNC_PFOUTPUT | GPIO_ALT_7  | GPIO_PORTQ | GPIO_PIN_4)

