apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c_pinmap.h
#  define GPIO_TR_CLK          (GPIO_FUNC_PFOUTPUT | GPIO_ALT_15 | GPIO_PORTF | GPIO_PIN_3)
#  define GPIO_TR_D0           (GPIO_FUNC_PFOUTPUT | GPIO_ALT_15 | GPIO_PORTF | GPIO_PIN_2)
#  define GPIO_TR_D1           (GPIO_FUNC_PFOUTPUT | GPIO_ALT_15 | GPIO_PORTF | GPIO_PIN_1)
#  define GPIO_TR_D2           (GPIO_FUNC_PFOUTPUT | GPIO_ALT_15 | GPIO_PORTF | GPIO_PIN_0)
#  define GPIO_TR_D3           (GPIO_FUNC_PFOUTPUT | GPIO_ALT_15 | GPIO_PORTF | GPIO_PIN_4)

#  define GPIO_TIM0_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_0)
#  define GPIO_TIM0_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_0)
#  define GPIO_TIM0_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTL | GPIO_PIN_4)
#  define GPIO_TIM0_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_1)
#  define GPIO_TIM0_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_1)
#  define GPIO_TIM0_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTL | GPIO_PIN_5)
#  define GPIO_TIM1_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_2)
#  define GPIO_TIM1_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_2)
#  define GPIO_TIM1_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTL | GPIO_PIN_6)
#  define GPIO_TIM1_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_3)
#  define GPIO_TIM1_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_3)
#  define GPIO_TIM1_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTL | GPIO_PIN_7)
#  define GPIO_TIM2_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_4)
#  define GPIO_TIM2_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_0)
#  define GPIO_TIM2_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_5)
#  define GPIO_TIM2_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_1)
#  define GPIO_TIM3_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_TIM3_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_4)
#  define GPIO_TIM3_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_2)
#  define GPIO_TIM3_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTA | GPIO_PIN_7)
#  define GPIO_TIM3_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_5)
#  define GPIO_TIM3_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_3)
#  define GPIO_TIM4_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_0)
#  define GPIO_TIM4_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_TIM4_CCP0_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_4)
#  define GPIO_TIM4_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_1)
#  define GPIO_TIM4_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_TIM4_CCP1_3     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_5)
#  define GPIO_TIM5_CCP0_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_2)
#  define GPIO_TIM5_CCP0_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_6)
#  define GPIO_TIM5_CCP1_1     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTB | GPIO_PIN_3)
#  define GPIO_TIM5_CCP1_2     (GPIO_FUNC_PFIO     | GPIO_ALT_3  | GPIO_PORTM | GPIO_PIN_7)

#  define GPIO_UART0_CTS_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTB | GPIO_PIN_4)
#  define GPIO_UART0_CTS_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTH | GPIO_PIN_1)
#  define GPIO_UART0_CTS_3     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTM | GPIO_PIN_4)
#  define GPIO_UART0_DCD_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTH | GPIO_PIN_2)
#  define GPIO_UART0_DCD_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTM | GPIO_PIN_5)
#  define GPIO_UART0_DCD_3     (GPIO_FUNC_PFINPUT  | GPIO_ALT_2  | GPIO_PORTP | GPIO_PIN_3)
#  define GPIO_UART0_DSR_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTH | GPIO_PIN_3)
#  define GPIO_UART0_DSR_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTM | GPIO_PIN_6)
#  define GPIO_UART0_DSR_3     (GPIO_FUNC_PFINPUT  | GPIO_ALT_2  | GPIO_PORTP | GPIO_PIN_4)
#  define GPIO_UART0_DTR       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_2)
#  define GPIO_UART0_RI_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTK | GPIO_PIN_7)
#  define GPIO_UART0_RI_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTM | GPIO_PIN_7)
#  define GPIO_UART0_RTS_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTB | GPIO_PIN_5)
#  define GPIO_UART0_RTS_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTH | GPIO_PIN_0)
#  define GPIO_UART0_RX        (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_0)
#  define GPIO_UART0_TX        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_1)
#  define GPIO_UART1_CTS_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_1)
#  define GPIO_UART1_CTS_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_3)
#  define GPIO_UART1_DCD_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_2)
#  define GPIO_UART1_DCD_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_2)
#  define GPIO_UART1_DSR_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_1)
#  define GPIO_UART1_DSR_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_3)
#  define GPIO_UART1_DTR_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_3)
#  define GPIO_UART1_DTR_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_4)
#  define GPIO_UART1_RI_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_4)
#  define GPIO_UART1_RI_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_5)
#  define GPIO_UART1_RTS_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTE | GPIO_PIN_0)
#  define GPIO_UART1_RTS_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTN | GPIO_PIN_0)
#  define GPIO_UART1_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTB | GPIO_PIN_0)
#  define GPIO_UART1_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTQ | GPIO_PIN_4)
#  define GPIO_UART1_TX        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTB | GPIO_PIN_1)
#  define GPIO_UART2_CTS_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_UART2_CTS_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_3)
#  define GPIO_UART2_RTS_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_UART2_RTS_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_2)
#  define GPIO_UART2_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_UART2_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_4)
#  define GPIO_UART2_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_7)
#  define GPIO_UART2_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTD | GPIO_PIN_5)
#  define GPIO_UART3_CTS_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_5)
#  define GPIO_UART3_CTS_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_5)
#  define GPIO_UART3_RTS_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_4)
#  define GPIO_UART3_RTS_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_2  | GPIO_PORTN | GPIO_PIN_4)
#  define GPIO_UART3_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_4)
#  define GPIO_UART3_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_0)
#  define GPIO_UART3_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_5)
#  define GPIO_UART3_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTJ | GPIO_PIN_1)
#  define GPIO_UART4_CTS       (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTK | GPIO_PIN_3)
#  define GPIO_UART4_RTS       (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTK | GPIO_PIN_2)
#  define GPIO_UART4_RX_1      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_2)
#  define GPIO_UART4_RX_2      (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTK | GPIO_PIN_0)
#  define GPIO_UART4_TX_1      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTA | GPIO_PIN_3)
#  define GPIO_UART4_TX_2      (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTK | GPIO_PIN_1)
#  define GPIO_UART5_RX        (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_6)
#  define GPIO_UART5_TX        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_7)
#  define GPIO_UART6_RX        (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_0)
#  define GPIO_UART6_TX        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTP | GPIO_PIN_1)
#  define GPIO_UART7_RX        (GPIO_FUNC_PFINPUT  | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_4)
#  define GPIO_UART7_TX        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_1  | GPIO_PORTC | GPIO_PIN_5)

#  define GPIO_USB0_CLK        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_14 | GPIO_PORTB | GPIO_PIN_3)
#  define GPIO_USB0_D0         (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTL | GPIO_PIN_0)
#  define GPIO_USB0_D1         (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTL | GPIO_PIN_1)
#  define GPIO_USB0_D2         (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTL | GPIO_PIN_2)
#  define GPIO_USB0_D3         (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTL | GPIO_PIN_3)
#  define GPIO_USB0_D4         (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTL | GPIO_PIN_4)
#  define GPIO_USB0_D5         (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTL | GPIO_PIN_5)
#  define GPIO_USB0_D6         (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTP | GPIO_PIN_5)
#  define GPIO_USB0_D7         (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTP | GPIO_PIN_4)
#  define GPIO_USB0_DIR        (GPIO_FUNC_PFOUTPUT | GPIO_ALT_14 | GPIO_PORTP | GPIO_PIN_3)
#  define GPIO_USB0_DM         (GPIO_FUNC_ANIO                   | GPIO_PORTL | GPIO_PIN_7)
#  define GPIO_USB0_DP         (GPIO_FUNC_ANIO                   | GPIO_PORTL | GPIO_PIN_6)
#  define GPIO_USB0_EPEN_1     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTA | GPIO_PIN_6)
#  define GPIO_USB0_EPEN_2     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_11 | GPIO_PORTA | GPIO_PIN_7)
#  define GPIO_USB0_EPEN_3     (GPIO_FUNC_PFOUTPUT | GPIO_ALT_5  | GPIO_PORTD | GPIO_PIN_6)
#  define GPIO_USB0_ID         (GPIO_FUNC_ANINPUT                | GPIO_PORTB | GPIO_PIN_0)
#  define GPIO_USB0_NXT        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTP | GPIO_PIN_2)
#  define GPIO_USB0_PFLT_1     (GPIO_FUNC_PFINPUT  | GPIO_ALT_5  | GPIO_PORTA | GPIO_PIN_7)
#  define GPIO_USB0_PFLT_2     (GPIO_FUNC_PFINPUT  | GPIO_ALT_5  | GPIO_PORTD | GPIO_PIN_7)
#  define GPIO_USB0_STP        (GPIO_FUNC_PFIO     | GPIO_ALT_14 | GPIO_PORTB | GPIO_PIN_2)
#  define GPIO_USB0_VBUS       (GPIO_FUNC_ANIO                   | GPIO_PORTB | GPIO_PIN_1)

#else
#  error "Unknown TIVA chip"
#endif

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

#endif /* __ARCH_ARM_SRC_TIVA_HARDWARE_TM4C_TM4C_PINMAP_H */
